In [1]:
sc

In [3]:
people_df = spark.read.json('file:///home/hadoop/Downloads/People.json')

In [4]:
people_df.printSchema()

root
 |-- city: string (nullable = true)
 |-- country: string (nullable = true)
 |-- first_name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- id: long (nullable = true)
 |-- last_name: string (nullable = true)
 |-- salary: long (nullable = true)

In [5]:
people_df.show()

+------------------+------------+----------+------+---+---------+------+
|              city|     country|first_name|gender| id|last_name|salary|
+------------------+------------+----------+------+---+---------+------+
|         Mulyosari|   Indonesia|     Valma|Female|  1|     Sans|983107|
|           Niihama|       Japan|     Paolo|  Male|  2|   Kiddie|649173|
|         Dū Qal‘ah| Afghanistan|    Miltie|  Male|  3| De Zuani|352898|
|            Iberia|        Peru|    Jarrid|  Male|  4| Dalziell|170398|
|          La Ronge|      Canada| Reinaldos|  Male|  5|   Keeffe|440989|
|      Kuala Lumpur|    Malaysia|        Eb|  Male|  6|Schwanden|274126|
|         Al Qurayn|Saudi Arabia|    Alleyn|  Male|  7|   Paddon|681914|
|           Jixiang|       China|   Baryram|  Male|  8|     Yell|250748|
|Thị Trấn Phong Thổ|     Vietnam|     Cammy|Female|  9|     Axel|221750|
|        Kotatengah|   Indonesia|       Erl|  Male| 10|  Caldera|680801|
|        Roldanillo|    Colombia|    Miguel|  Male| 11|   Moules|819771|
|            Malārd|        Iran| Mireielle|Female| 12|   Hurley|486029|
|     Fada N'gourma|Burkina Faso|    Feodor|  Male| 13| Grummitt|358045|
|           Ciangir|   Indonesia|     Diana|Female| 14|  Lawfull|397683|
|         El Cantón|   Venezuela|      Evie|Female| 15|   Kaysor|436202|
|          La Unión|    Colombia|    Janean|Female| 16|    Sayse|892405|
|            Xinhua|       China|     Colan|  Male| 17|   Stoppe|218434|
|     Крива Паланка|   Macedonia|      Erik|  Male| 18| Stitcher|776023|
|          Qīr Moāv|      Jordan|   Sargent|  Male| 19|   Cleall|819269|
|      Bogandinskiy|      Russia|   Tamqrah|Female| 20|Millichip|313540|
+------------------+------------+----------+------+---+---------+------+
only showing top 20 rows

#### 1. Create a User Definded Schema for field of DataFrame.

In [11]:
from pyspark.sql.functions import *
from pyspark.sql.types import IntegerType,StringType,StructType,StructField,LongType

In [13]:
schema = StructType([
    StructField("id", IntegerType(), True),
    StructField("first_name", StringType(), True),
    StructField("last_name", StringType(), True),
    StructField("gender", StringType(), True),
    StructField("salary", LongType(), True),
    StructField("city", StringType(), True),
    StructField("country", StringType(), True)
])

In [15]:
people_df = spark.read.schema(schema).json('file:///home/hadoop/Downloads/People.json')

In [19]:
# here "multiline = True" is required as the data given is in a multiline format,
# which indeed causes the normal read to create issue
bank_df = spark.read.json('file:///home/hadoop/Downloads/bank_edited.json', multiLine=True)

In [21]:
bank_df.show(2)

+---+-------+--------+-------+---+-------+--------+---------+-------+----------+----+-------+-----+-----+--------+--------+---+
|age|balance|campaign|contact|day|default|duration|education|housing|       job|loan|marital|month|pdays|poutcome|previous|  y|
+---+-------+--------+-------+---+-------+--------+---------+-------+----------+----+-------+-----+-----+--------+--------+---+
| 58|   2143|       1|unknown|  5|     no|     261| tertiary|    yes|management|  no|married|  may|   -1| unknown|       0| no|
| 44|     29|       1|unknown|  5|     no|     151|secondary|    yes|technician|  no| single|  may|   -1| unknown|       0| no|
+---+-------+--------+-------+---+-------+--------+---------+-------+----------+----+-------+-----+-----+--------+--------+---+
only showing top 2 rows

In [22]:
bank_df.printSchema()

root
 |-- age: long (nullable = true)
 |-- balance: long (nullable = true)
 |-- campaign: long (nullable = true)
 |-- contact: string (nullable = true)
 |-- day: long (nullable = true)
 |-- default: string (nullable = true)
 |-- duration: long (nullable = true)
 |-- education: string (nullable = true)
 |-- housing: string (nullable = true)
 |-- job: string (nullable = true)
 |-- loan: string (nullable = true)
 |-- marital: string (nullable = true)
 |-- month: string (nullable = true)
 |-- pdays: long (nullable = true)
 |-- poutcome: string (nullable = true)
 |-- previous: long (nullable = true)
 |-- y: string (nullable = true)

In [ ]:

from pyspark.sql.types import IntegerType,StructField,StringType,StructField,LongType,DoubleType

schema = StructType([
    StructField('age',IntegerType,True),
    StructField('balance',DoubleType,True),
    StructField('campaign',IntegerType,True),
    StructField('contact',StringType,True),
    StructField('default',StringType,True),
    StructField('duration',IntegerType,True),
    StructField('education',StringType,True),
    StructField('housing',StringType,True),
    StructField('job',StringType,True),
    StructField('loan',StringType,True),
    StructField('marital',StringType,True),
    StructField('month',IntegerType,True),
    StructField('contact',StringType,True),
    StructField('pdays',StringType,True),
    StructField('poutcome',IntegerType,True),
    StructField('previous',IntegerType,True),
    StructField('y',IntegerType,True)
])

In [24]:
# Any column operations we need to perform we do it with withColumn.
bank_df.withColumn('age',col('age').cast('int'))

DataFrame[age: int, balance: bigint, campaign: bigint, contact: string, day: bigint, default: string, duration: bigint, education: string, housing: string, job: string, loan: string, marital: string, month: string, pdays: bigint, poutcome: string, previous: bigint, y: string]

#### 3. Creating new column from two strings.

In [31]:
from pyspark.sql.functions import concat

people_df.withColumn('Full_Name',concat(col('first_name'),lit(' '),col('last_name'))).show(2)

+---+----------+---------+------+------+---------+---------+------------+
| id|first_name|last_name|gender|salary|     city|  country|   Full_Name|
+---+----------+---------+------+------+---------+---------+------------+
|  1|     Valma|     Sans|Female|983107|Mulyosari|Indonesia|  Valma Sans|
|  2|     Paolo|   Kiddie|  Male|649173|  Niihama|    Japan|Paolo Kiddie|
+---+----------+---------+------+------+---------+---------+------------+
only showing top 2 rows

#### 4. Renaming an existing column

In [33]:
people_df = people_df.withColumnRenamed('salary','income')

In [34]:
people_df.show()

+---+----------+---------+------+------+------------------+------------+
| id|first_name|last_name|gender|income|              city|     country|
+---+----------+---------+------+------+------------------+------------+
|  1|     Valma|     Sans|Female|983107|         Mulyosari|   Indonesia|
|  2|     Paolo|   Kiddie|  Male|649173|           Niihama|       Japan|
|  3|    Miltie| De Zuani|  Male|352898|         Dū Qal‘ah| Afghanistan|
|  4|    Jarrid| Dalziell|  Male|170398|            Iberia|        Peru|
|  5| Reinaldos|   Keeffe|  Male|440989|          La Ronge|      Canada|
|  6|        Eb|Schwanden|  Male|274126|      Kuala Lumpur|    Malaysia|
|  7|    Alleyn|   Paddon|  Male|681914|         Al Qurayn|Saudi Arabia|
|  8|   Baryram|     Yell|  Male|250748|           Jixiang|       China|
|  9|     Cammy|     Axel|Female|221750|Thị Trấn Phong Thổ|     Vietnam|
| 10|       Erl|  Caldera|  Male|680801|        Kotatengah|   Indonesia|
| 11|    Miguel|   Moules|  Male|819771|        Roldanillo|    Colombia|
| 12| Mireielle|   Hurley|Female|486029|            Malārd|        Iran|
| 13|    Feodor| Grummitt|  Male|358045|     Fada N'gourma|Burkina Faso|
| 14|     Diana|  Lawfull|Female|397683|           Ciangir|   Indonesia|
| 15|      Evie|   Kaysor|Female|436202|         El Cantón|   Venezuela|
| 16|    Janean|    Sayse|Female|892405|          La Unión|    Colombia|
| 17|     Colan|   Stoppe|  Male|218434|            Xinhua|       China|
| 18|      Erik| Stitcher|  Male|776023|     Крива Паланка|   Macedonia|
| 19|   Sargent|   Cleall|  Male|819269|          Qīr Moāv|      Jordan|
| 20|   Tamqrah|Millichip|Female|313540|      Bogandinskiy|      Russia|
+---+----------+---------+------+------+------------------+------------+
only showing top 20 rows

#### 5. Limit()

In [35]:
people_df.limit(10).show()

+---+----------+---------+------+------+------------------+------------+
| id|first_name|last_name|gender|income|              city|     country|
+---+----------+---------+------+------+------------------+------------+
|  1|     Valma|     Sans|Female|983107|         Mulyosari|   Indonesia|
|  2|     Paolo|   Kiddie|  Male|649173|           Niihama|       Japan|
|  3|    Miltie| De Zuani|  Male|352898|         Dū Qal‘ah| Afghanistan|
|  4|    Jarrid| Dalziell|  Male|170398|            Iberia|        Peru|
|  5| Reinaldos|   Keeffe|  Male|440989|          La Ronge|      Canada|
|  6|        Eb|Schwanden|  Male|274126|      Kuala Lumpur|    Malaysia|
|  7|    Alleyn|   Paddon|  Male|681914|         Al Qurayn|Saudi Arabia|
|  8|   Baryram|     Yell|  Male|250748|           Jixiang|       China|
|  9|     Cammy|     Axel|Female|221750|Thị Trấn Phong Thổ|     Vietnam|
| 10|       Erl|  Caldera|  Male|680801|        Kotatengah|   Indonesia|
+---+----------+---------+------+------+------------------+------------+

#### OrderBy() 
        * Arrange Data in ascending & descending order.

In [41]:
people_df.orderBy(['income'],ascending = False).show(2)

+---+----------+---------+------+------+-------------------+--------------+
| id|first_name|last_name|gender|income|               city|       country|
+---+----------+---------+------+------+-------------------+--------------+
|651| Frederigo|    Ogers|  Male|999360|             Pentre|United Kingdom|
|652|  Hurleigh|     Plom|  Male|998944|Grodzisk Mazowiecki|        Poland|
+---+----------+---------+------+------+-------------------+--------------+
only showing top 2 rows

In [42]:
people_df.orderBy(['gender','income'], ascending = [False,True]).show(5)

+---+----------+---------+------+------+------------+---------+
| id|first_name|last_name|gender|income|        city|  country|
+---+----------+---------+------+------+------------+---------+
| 93|      Cory|    Prigg|  Male| 12876|     Gondang|Indonesia|
|590|      Flem| Tumielli|  Male| 13347| Debre Zeyit| Ethiopia|
|192|       Odo|  Conyers|  Male| 15555|  Raffingora| Zimbabwe|
|407|  Barbabas|Ballingal|  Male| 18598|Beringinjaya|Indonesia|
| 24|   Avigdor|  Goddman|  Male| 20216|       Gujun|    China|
+---+----------+---------+------+------+------------+---------+
only showing top 5 rows

#### Materialized View
        * createOrReplaceTempView() -> creates a temporary dataframe
        * the original data is not changed

In [43]:
bank_df.createOrReplaceTempView('bankData')

In [45]:
spark.sql('SELECT * FROM bankData').show(4)

+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+-------+-----+-----+--------+--------+---+
|age|balance|campaign|contact|day|default|duration|education|housing|         job|loan|marital|month|pdays|poutcome|previous|  y|
+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+-------+-----+-----+--------+--------+---+
| 58|   2143|       1|unknown|  5|     no|     261| tertiary|    yes|  management|  no|married|  may|   -1| unknown|       0| no|
| 44|     29|       1|unknown|  5|     no|     151|secondary|    yes|  technician|  no| single|  may|   -1| unknown|       0| no|
| 33|      2|       1|unknown|  5|     no|      76|secondary|    yes|entrepreneur| yes|married|  may|   -1| unknown|       0| no|
| 47|   1506|       1|unknown|  5|     no|      92|  unknown|    yes| blue-collar|  no|married|  may|   -1| unknown|       0| no|
+---+-------+--------+-------+---+-------+--------+---------+-------+------------+----+-------+-----+-----+--------+--------+---+
only showing top 4 rows

In [61]:
spark.sql("SELECT * FROM bankData WHERE age > 58 and education = 'tertiary' LIMIT 1").collect()[0]

Row(age=60, balance=100, campaign=1, contact='unknown', day=5, default='no', duration=528, education='tertiary', housing='no', job='retired', loan='no', marital='married', month='may', pdays=-1, poutcome='unknown', previous=0, y='no')

* Show top 10 youngest age group with maximum balance
* Show worst 5 job type having minimum salary

In [83]:
spark.sql("SELECT age, MAX(balance) FROM bankData GROUP BY age ORDER BY age ASC LIMIT 10").show()

+---+------------+
|age|max(balance)|
+---+------------+
| 18|        1944|
| 19|        5368|
| 20|        8860|
| 21|        8278|
| 22|       10971|
| 23|       19690|
| 24|       23878|
| 25|       16874|
| 26|       24299|
| 27|       24025|
+---+------------+

In [89]:
spark.sql("SELECT job, MIN(balance) as min_bal FROM bankData GROUP BY job ORDER BY min_bal ASC LIMIT 5").show()

+-------------+-------+
|          job|min_bal|
+-------------+-------+
|  blue-collar|  -8019|
|   management|  -6847|
|self-employed|  -3313|
|   technician|  -2827|
|     services|  -2122|
+-------------+-------+